/*
 * ************************************************************
 *   _     _              _   _                 _ _           
 *  | |   (_)_ __   ___  | | | | __ _ _ __   __| | | ___ _ __ 
 *  | |   | | '_ \ / _ \ | |_| |/ _` | '_ \ / _` | |/ _ \ '__|
 *  | |___| | | | |  __/ |  _  | (_| | | | | (_| | |  __/ |   
 *  |_____|_|_| |_|\___| |_| |_|\__,_|_| |_|\__,_|_|\___|_|   
 *
 * Octoller.LineCommander
 * 03.10.2020
 *  
 ************************************************************** 
 */

namespace Octoller.OrderLineHandler.ServiceObjects {

    public enum TransitionSign {

        None = -1,      //если нет признака перехода
        NextFalse = 0,  //переход при результате false
        NextTrue = 1,   //переход при результате true
        NextAny = 2     //переход не зависит от результата
    }
}
